/**
 * Kiểm tra điều khiển xe kết hợp 2 kênh A và B
 * https://hshop.vn/mach-dieu-khien-dong-co-mkl-m10-i2c-motor-control-module
 */

/* ------------------------------------------------------------------------- */
/*                                  LIBRARY                                  */
/* ------------------------------------------------------------------------- */

#include "Makerlabvn_SimpleMotor.h"

/* ------------------------------------------------------------------------- */
/*                                   DEFINE                                  */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/*                                   OBJECT                                  */
/* ------------------------------------------------------------------------- */

Makerlabvn_SimpleMotor demo;

/* ------------------------------------------------------------------------- */
/*                                RUN ONE TIME                               */
/* ------------------------------------------------------------------------- */

void setup()
{
  Serial.begin(115200);
  Serial.println("Start");

  demo.setup(0x40);

}

/* ------------------------------------------------------------------------- */
/*                                    MAIN                                   */
/* ------------------------------------------------------------------------- */

void loop()
{
  Serial.println("Điều khiển xe...");
  Serial.println();
  delay(1000);

  /* ----------------------------------------------------------------------- */

  Serial.println("Đi thẳng tốc độ 100%.");
  demo.car_fw(100, 100);
  delay(5000);

  Serial.println("Đi thẳng tốc độ 100%, rẽ trái.");
  demo.car_fw(0, 100);
  delay(5000);

  Serial.println("Đi thẳng tốc độ 100%, rẽ phải.");
  demo.car_fw(100, 0);
  delay(5000);

  /* ----------------------------------------------------------------------- */

  Serial.println("Đi lùi tốc độ 100%.");
  demo.car_bw(100, 100);
  delay(5000);

  Serial.println("Đi lùi tốc độ 100%, rẽ trái.");
  demo.car_bw(0, 100);
  delay(5000);

  Serial.println("Đi lùi tốc độ 100%, rẽ phải.");
  demo.car_bw(100, 0);
  delay(5000);

  /* ----------------------------------------------------------------------- */

  Serial.println("Xoay trái tốc độ 10%.");
  demo.car_rotateL(30);
  delay(5000);

  Serial.println("Xoay phải tốc độ 50%.");
  demo.car_rotateR(20);
  delay(5000);

  /* ----------------------------------------------------------------------- */

  Serial.println("Dừng lại.");
  demo.car_stop();
  delay(5000);
}